{
  "backend/main.mo": "Main Motoko actor defining the backend for a Resource & Project Management app, including persistent storage for resources, timesheets, projects, user profiles, and Power BI embed URL, along with type definitions and authorization helpers.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of loading spinner and skeleton screen components across Dashboard, Resources, Projects, and Timesheets pages, listing all affected files and related test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing the purpose and key details of components, pages, hooks, and utilities in the frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including color tokens for background, foreground, sidebar, charts, and UI elements.",
  "frontend/index.html": "Minimal HTML shell for the React app, mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Main React app entry point setting up TanStack Router, React Query, demo auth context, role-based route access control, and a route guard that redirects unauthorized users to an access denied screen.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied message with the user's current role label and provides buttons to navigate to the user's default route or log out, supporting both demo and Internet Identity auth modes.",
  "frontend/src/components/ActivityFeed.tsx": "Renders a list of recent activity events (timesheet, project, resource actions) with icons, descriptions, and relative timestamps, or an empty state message if no events exist.",
  "frontend/src/components/ActivityFeedSkeleton.tsx": "Skeleton placeholder for the ActivityFeed component, rendering five shimmer rows with circular icon and text placeholders to indicate loading state.",
  "frontend/src/components/DashboardDateFilter.tsx": "A date filter component for the dashboard that provides month/year selects and an optional specific date input, syncing all three controls together and emitting a unified FilterState via onChange.",
  "frontend/src/components/HoursChart.tsx": "A bar chart component using Recharts that displays hours logged per project, with color-coded bars and an empty-state message when no data is available.",
  "frontend/src/components/HoursChartSkeleton.tsx": "A skeleton loading placeholder for the HoursChart component, rendering animated skeleton bars and labels to indicate loading state.",
  "frontend/src/components/Layout.tsx": "The main application layout component featuring a collapsible sidebar with role-based navigation items, a logo, user profile display, and logout functionality supporting both Internet Identity and demo mode.",
  "frontend/src/components/LoginPage.tsx": "The login page component that supports Internet Identity authentication and demo mode login with selectable roles, and includes a profile setup form for new users.",
  "frontend/src/components/MilestoneChecklist.tsx": "A checklist component for project milestones that displays completion progress, allows toggling milestone completion with loading state, and supports a read-only mode.",
  "frontend/src/components/PowerBIConfigModal.tsx": "A modal dialog for admins to configure and save a Power BI embed URL, with input validation, a preview link, and mutation-based save with toast notifications.",
  "frontend/src/components/ProjectDetailModal.tsx": "A modal dialog that displays full project details including status, progress, milestones, budget, dates, manager, and assigned resources, with optional edit and delete actions.",
  "frontend/src/components/ProjectFormModal.tsx": "A modal form for creating or editing a project, with fields for name, description, status, dates, budget, manager, and resource assignment.",
  "frontend/src/components/ProjectKanbanBoard.tsx": "Renders a four-column Kanban board grouped by project status, with inline card components showing progress, manager, and edit/delete actions, plus skeleton loading support.",
  "frontend/src/components/ProjectKanbanCardSkeleton.tsx": "A skeleton placeholder component that mimics the layout of a Kanban project card during loading states.",
  "frontend/src/components/ResourceCard.tsx": "Displays a resource's avatar, name, role, department, email, skill tags, and active/inactive status in a card with hover-revealed edit and delete buttons.",
  "frontend/src/components/ResourceCardSkeleton.tsx": "A skeleton placeholder component that mimics the layout of a resource card during loading states.",
  "frontend/src/components/ResourceFormModal.tsx": "A modal form for creating or editing a resource, including fields for name, role, department, email, status, billability, dates, and a multi-select skill tags picker with custom input support.",
  "frontend/src/components/ResourceImportModal.tsx": "A modal dialog for bulk-importing resources via CSV upload, including CSV parsing, validation, error reporting, and a downloadable sample template generator.",
  "frontend/src/components/ResourceTableSkeleton.tsx": "Renders a loading skeleton placeholder for the resource table with 7 columns and 7 placeholder rows.",
  "frontend/src/components/ResourceTableView.tsx": "Displays a sortable table of resources with billability and status badges, and edit/delete action buttons per row.",
  "frontend/src/components/SummaryCard.tsx": "A styled card component that displays a labeled metric value with an icon, optional trend text, and configurable accent color.",
  "frontend/src/components/SummaryCardSkeleton.tsx": "Renders a loading skeleton placeholder matching the layout of a SummaryCard.",
  "frontend/src/components/TimesheetEntryFormModal.tsx": "A modal form for creating or editing a timesheet entry, with fields for resource, project, date, hours, and description, including validation.",
  "frontend/src/components/WeeklyTimesheetView.tsx": "Displays a weekly timesheet view with a 7-day column summary, per-day hour totals, and a list of entries with edit, delete, and submit actions.",
  "frontend/src/components/WeeklyTimesheetViewSkeleton.tsx": "Renders a loading skeleton placeholder for the weekly timesheet view, including day columns and entry row placeholders.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous backend actor using Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useDemoAuth.ts": "Provides a `useDemoAuth` hook that manages a demo session stored in localStorage, allowing login/logout as predefined user profiles for each available role.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using `@dfinity/auth-client`, exposing login/logout state and identity to child components via a React context hook.",
  "frontend/src/hooks/useMultiSelectDropdown.ts": "Provides a `useMultiSelectDropdown` hook with state management for a searchable multi-select dropdown, including a predefined list of skill options, filtering, and add/remove/reset operations.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on resources, projects, timesheets, milestones, and user profiles by calling the backend actor, with cache invalidation on mutations.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS, and defines CSS custom properties for light/dark theme tokens including colors for UI components, charts, and the sidebar.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, nanosecond/Date conversions, date formatting, week boundary calculation, ID generation, currency formatting, and period-based date filtering.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider` into the DOM root.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page that fetches resources, projects, and timesheet entries, filters them by a selected date period, and renders summary cards, an hours-per-project chart, and an activity feed with loading skeletons.",
  "frontend/src/pages/ProjectsPage.tsx": "Page component for managing projects with a Kanban board view, supporting create/edit/delete operations via modals and an alert dialog for delete confirmation.",
  "frontend/src/pages/ReportsPage.tsx": "Page component that embeds a Power BI report in an iframe, restricted to admin/management roles, with admin-only configuration and a refresh control.",
  "frontend/src/pages/ResourcesPage.tsx": "Page component for managing resources with table/card views, search and filter controls, and support for create/edit/delete/import/export operations.",
  "frontend/src/pages/TimesheetsPage.tsx": "Page component displaying a weekly timesheet view with time entry logging, edit, delete, and optional approval actions based on role permissions.",
  "frontend/src/utils/exportUtils.ts": "Utility functions for exporting resource data as CSV (or a CSV fallback for XLSX), mapping resource fields to a fixed RMG template column layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, using sessionStorage for persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-mode-enabled theme with oklch CSS variable-based color tokens (background, primary, sidebar, chart, etc.), custom border radii, Inter/JetBrains Mono fonts, and accordion/shimmer/loading-bar keyframe animations.",
  "project_state.json": "Project state manifest (version 25) describing a Resource Management, Timesheet & Project Tracking SPA hosted on ICP, including architectural notes, role-based access details, known issues, and a registry of existing and planned features."
}